Connected to Python 3.13.11

In [1]:
# Importing the libraries
import numpy as np
import pandas as pd

df = pd.read_csv(r"F:\Coding\Python\Uncleaned.csv")
print(df.head())

   Employee ID       Employee Name Employee Position   Salary   Age  Gender  \
0          178  Christopher Reilly          employee  99280.0  62.0    Male
1            2     Jennifer Newton          employee  66717.0   NaN    Male
2           42         Dakota Khan     Administrator  87759.0  56.0  Female
3          177          Nancy Long           Techies  75973.0  59.0    Male
4           55      Jeffrey Miller           Techies  67856.0  45.0    Male

       Department   Hire Date
0        Accounts  2020-07-28
1             NaN  2018-11-04
2        Accounts  2023-03-30
3      Manegement  2018-06-27
4  Administration  2022-03-19

In [2]:
# Importing the libraries
import numpy as np
import pandas as pd

df = pd.read_csv(r"F:\Coding\Python\Uncleaned.csv")
df.head()

,Employee ID,Employee Name,Employee Position,Salary,Age,Gender,Department,Hire Date
0,178,Christopher Reilly,employee,99280.0,62.0,Male,Accounts,2020-07-28
1,2,Jennifer Newton,employee,66717.0,NaN,Male,NaN,2018-11-04
2,42,Dakota Khan,Administrator,87759.0,56.0,Female,Accounts,2023-03-30
3,177,Nancy Long,Techies,75973.0,59.0,Male,Manegement,2018-06-27
4,55,Jeffrey Miller,Techies,67856.0,45.0,Male,Administration,2022-03-19

In [3]:
# Importing the libraries
import numpy as np
import pandas as pd

df = pd.read_csv(r"F:\Coding\Python\Uncleaned.csv")
df.head(10)

,Employee ID,Employee Name,Employee Position,Salary,Age,Gender,Department,Hire Date
0,178,Christopher Reilly,employee,99280.0,62.0,Male,Accounts,2020-07-28
1,2,Jennifer Newton,employee,66717.0,NaN,Male,NaN,2018-11-04
2,42,Dakota Khan,Administrator,87759.0,56.0,Female,Accounts,2023-03-30
3,177,Nancy Long,Techies,75973.0,59.0,Male,Manegement,2018-06-27
4,55,Jeffrey Miller,Techies,67856.0,45.0,Male,Administration,2022-03-19
5,46,Elizabeth Tanner,Manager,89041.0,65.0,Male,Accounts,2019-05-15
6,5,Shawn Harrington,Techies,74446.0,NaN,Female,Accounts,2022-12-05
7,44,Matthew Knapp,employee,72556.0,42.0,Female,Sales,2022-12-10
8,83,Jessica Shepherd,employee,10.0,32.0,Female,Accounts,2019-10-25
9,111,Anna Logan,Manager,65501.0,57.0,Male,Manegement,2017-11-07

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             205 non-null    object
 4   Age                206 non-null    float64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 13.1+ KB

In [5]:
df.shape

(208, 8)

In [6]:
missing_count = df.isnull().sum()
print(missing_count)

Employee ID          0
Employee Name        0
Employee Position    0
Salary               3
Age                  2
Gender               1
Department           3
Hire Date            1
dtype: int64

In [7]:
df["Salary"] = pd.to_numeric(df["Salary"])

ValueError: Unable to parse string "Sixty Thousand" at position 100

In [ ]:
df["Salary"] = df["Salary"].replace("Sixty Thousand", 60000)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                206 non-null    float64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 13.1+ KB

In [ ]:
df.loc[(df["Age"]<18) | (df["Age"]>60), "Age"] = np.nan

In [ ]:
df.shape

(208, 8)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee ID        208 non-null    int64
 1   Employee Name      208 non-null    object
 2   Employee Position  208 non-null    object
 3   Salary             208 non-null    float64
 4   Age                175 non-null    float64
 5   Gender             207 non-null    object
 6   Department         205 non-null    object
 7   Hire Date          207 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 13.1+ KB

In [ ]:
df["Age"] = df["Age"].fillna(df["Age"].mean())